---
type: Room
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 9
tags: [revit-api, class]
---

# Room

`Autodesk.Revit.DB.Architecture.Room` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsPointInRoom | — | `public bool IsPointInRoom ( XYZ point )` |
| Method | Unplace | — | `public void Unplace ()` |
| Property | BaseOffset | — | `public double BaseOffset { get ; set ; }` |
| Property | ClosedShell | — | `public GeometryElement ClosedShell { get ; }` |
| Property | LimitOffset | — | `public double LimitOffset { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | UnboundedHeight | — | `public double UnboundedHeight { get ; }` |
| Property | UpperLimit | — | `public Level UpperLimit { get ; set ; }` |
| Property | Volume | — | `public double Volume { get ; }` |